ConfigFiles/Catalogs/ПриоритетыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриоритетыРабот</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ОчередиРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередиРаботСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокНомерВОчереди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>12</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокПриоритета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВОчереди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Catalogs/ПриоритетыРабот/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ДанныеПередЗаписью", ДанныеПередЗаписью());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПередЗаписью = ДополнительныеСвойства.ДанныеПередЗаписью;
	
	Если Не ДанныеПередЗаписью.ПриоритетПоУмолчанию 
		И ПриоритетПоУмолчанию Тогда
		
		СнятьПризнакОсновнойУДругихПриоритетовЕслиНеобходимо();
		Справочники.ПриоритетыРабот.УстановитьПриоритетПоУмолчаниюВФоне(Владелец, Истина);

		
	ИначеЕсли Не ДанныеПередЗаписью.ПометкаУдаления 
		И ПометкаУдаления Тогда
		
		Справочники.ПриоритетыРабот.УстановитьПриоритетПоУмолчаниюВФоне(Владелец, Истина);
			
	ИначеЕсли ДанныеПередЗаписью.ПометкаУдаления 
		И Не ПометкаУдаления Тогда
		
		Справочники.ПриоритетыРабот.УстановитьПриоритетПоУмолчаниюВФоне(Владелец, Истина);
		
	ИначеЕсли ДанныеПередЗаписью.Порядок <> Порядок Тогда
		
		РегистрыСведений.ОчередиРаботСотрудников.СформироватьОчередьРаботСотрудников(
			РегистрыСведений.ОчередиРаботСотрудников.НовыйПараметрыФормированияОчередиСотрудников());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Порядок = 0;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДанныеДоступныхЗначенийПорядка = Справочники.ПриоритетыРабот.ДоступныеДляПроектаЗначенияПорядкаПриоритета(Владелец, Ссылка);
	
	Если ДанныеДоступныхЗначенийПорядка.ДоступныеЗначения.Найти(Порядок) = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Недопустимое значение порядка.'") + " " + ДанныеДоступныхЗначенийПорядка.Представление;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Порядок",,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СнятьПризнакОсновнойУДругихПриоритетовЕслиНеобходимо()

	Если ПриоритетПоУмолчанию Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПриоритетыРабот.Ссылка       КАК Ссылка,
		|	ПриоритетыРабот.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПриоритетыРабот КАК ПриоритетыРабот
		|ГДЕ
		|	ПриоритетыРабот.Ссылка <> &Ссылка
		|	И ПриоритетыРабот.ПриоритетПоУмолчанию
		|	И ПриоритетыРабот.Владелец = &Проект";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Проект", Владелец);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Попытка
				ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
			Исключение
				ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось заблокировать приоритет ""%1"" для снятия признака ""Приоритет по умолчанию"". %2'"), 
				                        Выборка.Наименование,
				                        КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				                        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Выборка.Ссылка);
				Отказ = Истина;
				Возврат;
			КонецПопытки;
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.ПриоритетПоУмолчанию = Ложь;
			
			Попытка
				СправочникОбъект.Записать();
			Исключение
				ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось записать приоритет ""%1"" для снятия признака ""Приоритет по умолчанию"". %2'"), 
				                        СправочникОбъект.Наименование, 
				                        КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, СправочникОбъект.Ссылка);
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеПередЗаписью() 
	
	ДанныеПередЗаписью = Новый Структура;
	ДанныеПередЗаписью.Вставить("ПометкаУдаления",      Ложь);
	ДанныеПередЗаписью.Вставить("ПриоритетПоУмолчанию", Ложь);
	ДанныеПередЗаписью.Вставить("Порядок",              0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПриоритетыРабот.ПометкаУдаления      КАК ПометкаУдаления,
	|	ПриоритетыРабот.ПриоритетПоУмолчанию КАК ПриоритетПоУмолчанию,
	|	ПриоритетыРабот.Порядок              КАК Порядок
	|ИЗ
	|	Справочник.ПриоритетыРабот КАК ПриоритетыРабот
	|ГДЕ
	|	ПриоритетыРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		ДанныеПередЗаписью.ПометкаУдаления      = Выборка.ПометкаУдаления;
		ДанныеПередЗаписью.ПриоритетПоУмолчанию = Выборка.ПриоритетПоУмолчанию;
		ДанныеПередЗаписью.Порядок              = Выборка.Порядок;
	
	КонецЕсли;
	
	Возврат ДанныеПередЗаписью;
	
КонецФункции

#КонецОбласти

#КонецЕсли
